# LightNode Properties

---
The LightNode type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from RenderNode)
| NodeName|  A readable name of the output node. (Inherited from RenderNode)
Top
#### Reference
LightNode Class
Autodesk.Revit.DB Namespace